Repository: souravkaushik-dev/dottunes
Catalog: lib/localization/app_*.arb
Languages: gl

source: About
gl: Acerca de

# accentChangeMsg
source: Accent color updated successfully
gl: Cor de destaque actualizada

source: Accent color
gl: Cor de destaque

source: Add
gl: Engadir

source: Add to playlist
gl: Engadir á lista de reproducción

# addedSuccess
source: Added successfully
gl: Agregado correctamente

source: Album
gl: Álbum

source: Albums
gl: Álbumes

# appUpdateIsAvailable
source: An update is available
gl: Actualización dispoñible

source: Artist
gl: Artista

source: Audio quality
gl: Calidade de audio

# audioQualityMsg
source: Audio quality updated
gl: Calidade de audio actualizada

source: Automatic song picker
gl: Selector automático de cancións

# backedupSuccess
source: Data successfully backed up
gl: Datos gardados correctamente

# backupError
source: Error occurred while backing up data
gl: Erro ao gardar os datos

source: Backup user data
gl: Gardar datos da persoa usuaria

# becomeSponsor
source: Become a sponsor
gl: Converterse en patrocinador

# cacheMsg
source: Cache cleared
gl: Caché eliminada

source: Cancel
gl: Cancelar

# chooseBackupDir
source: Choose backup folder
gl: Seleccionar cartafol de respaldo

# chooseBackupFiles
source: Select files for backup
gl: Escolle ficheiros de respaldo

source: Clear
gl: Borrar

source: Clear cache
gl: Borrar caché

source: Clear recently played
gl: Borrar reproducido recientemente

# clearRecentlyPlayedQuestion
source: Are you sure you want to clear recently played history?
gl: Borrar o historial de reproducción recente?

source: Clear search history
gl: Borrar historial de búsqueda

# clearSearchHistoryQuestion
source: Are you sure you want to clear search history?
gl: Borrar o historial de búsqueda?

source: Confirm
gl: Confirmar

source: Confirmation
gl: Confirmación

source: Copy logs
gl: Copiar rexistros

# copyLogsNoLogs
source: No logs to copy
gl: Non hai rexistros para copiar

# copyLogsSuccess
source: Logs copied successfully
gl: Rexistros copiados correctamente

# customPlaylistImgUrl
source: Custom playlist image URL
gl: URL de imaxe personalizada para a lista de reproducción

source: Custom playlist name
gl: Nome personalizado da lista de reproducción

source: Download
gl: Descargar

source: Download app update
gl: Descargar actualización da aplicación

# dynamicColor
source: Dynamic accent color (Android 12+)
gl: Cor de destaque dinámica (Android 12+)

# error
source: An error occurred. Please try again.
gl: Ocurriu un erro. Por favor, téntao de novo.

# folderRestrictions
source: Android restrictions require selecting specific folders (e.g., Documents or Downloads) for backup.
gl: As restriccións de Android requiren seleccionar cartafoles específicos (p.e., Documentos ou Descargas) para respaldos.

source: Home
gl: Coemzo

source: Invalid YouTube playlist
gl: Lista de reproducción de YouTube non válida

source: Language
gl: Idioma

# languageMsg
source: Language updated successfully
gl: Cambiouse o idioma

source: Library
gl: Biblioteca

source: Licenses
gl: Licenzas

source: Liked playlists
gl: Listas de reproducción que gustan

source: Liked songs
gl: Cancións que gustan

source: Lyrics
gl: Letras

source: Lyrics not available
gl: Non hai letras dispoñibles

source: Name
gl: Nome

# noCustomPlaylists
source: No custom playlists created yet
gl: Aínda non se crearon listas de reproducción personalizadas

# notYTlist
source: Invalid YouTube playlist ID
gl: ID de lista de reproducción de YouTube non válido

source: Offline mode
gl: Modo sen conexión

source: Offline songs
gl: Cancións sen conexión

# originalRecommendations
source: Original recommendation algorithm
gl: Algoritmo de recomendacións orixinal

source: Others
gl: Outros

source: Playlist
gl: Lista de reproducción

source: Playlist already exists
gl: A lista de reproducción xa existe

# playlistUpdated
source: Playlist updated successfully
gl: Lista de reproducción actualizada

source: Playlists
gl: Listas de reproducción

# predictiveBack
source: Predictive back (Android 14+)
gl: Retroceso predictivo (Android 14+)

source: Preferences
gl: Preferenzas

# provideIdOrNameError
source: Please provide a YouTube ID or custom playlist name
gl: Por favor, proporciona un ID de YouTube ou un nome personalizado para a lista de reproducción

source: Pure black theme
gl: Tema negro puro

source: Recently played
gl: Reproducido recentemente

# recentlyPlayedMsg
source: Recently played history cleared
gl: Historial de reproducción recente borrado

source: Recommended for you
gl: Recomendado para ti

source: Remove
gl: Eliminar

# removePlaylistQuestion
source: Are you sure you want to remove this playlist?
gl: Eliminar a lista de reproducción?

# removeSearchQueryQuestion
source: Are you sure you want to remove this search query?
gl: Eliminar a consulta de búsqueda?

# restartAppMsg
source: Restart the app to apply changes
gl: Reinicia a aplicación para aplicar os cambios

# restoreError
source: Error restoring data
gl: Erro ao restaurar os datos

source: Restore user data
gl: Restaurar datos do/a usuario/a

# restoredSuccess
source: Data restored successfully
gl: Restaurado

source: Search
gl: Buscar

# searchHistoryMsg
source: Search history cleared
gl: Historial de búsqueda borrado

# settingChangedMsg
source: Settings updated successfully
gl: Axustes cambiados

source: Settings
gl: Axustes

source: Song added
gl: Canción engadida

source: Song removed
gl: Canción eliminada

source: Songs
gl: Cancións

# sponsorProject
source: Sponsor the project
gl: Patrocina o proxecto

source: Suggested artists
gl: Artistas suxeridos/as

source: Suggested playlists
gl: Listas de reproducción suxeridas

source: Theme mode
gl: Modo de tema

source: Tools
gl: Ferramentas

# understand
source: I understand
gl: Entendo

source: Undo
gl: Desfacer

# useSquigglySlider
source: Swift slider
gl: Usar deslizador ondulado

# userPlaylists
source: my .tunes
gl: Listas de reproducción do/a usuario/a

source: YouTube playlist link or ID
gl: Ligazón ou ID de lista de reproducción de YouTube
